#+title: Jupyter


Org mode can be used in much the same way as a Jupyter notebook, allowing the interspersing of explanatory text and code. Blocks of Emacs Lisp code can be executed using a live REPL. Org mode provides syntax highlighting for multiple programming languages.


#+begin_src elisp

;; Individual S-expressions can be evaluated directly using "C-c e" (or "C-x e") with the cursor point on the closing paren for the S-expression. This executes the `org-babel-execute-src-block` function.

(* 3 2) ; => 6

;; The complete code block can be evaluated using "C-c C-c". This will execute the code black and return the output of the last procedure as inserted text under a "#+RESULTS" heading.

(defun cube (n)
  (* n n n))

(cube 8)

#+end_src

#+RESULTS:
: 512
